function ∇ELBO!(x, s::HAFVFmultivariate, stm1::HAFVFmultivariate, s0::HAFVFmultivariate, lag)

end

F(r,μ, κ, η, Λ,μ1,κ1,η1,Λ1,αᵅ1,βᵅ1,αᵝ1,βᵝ1,μ2,κ2,η2,Λ2,αᵅ2,βᵅ2,αᵝ2,βᵝ2,t) = a->ELBOniw(r,μ, κ, η, Λ, a..., μ1,κ1,η1,Λ1,αᵅ1,βᵅ1,αᵝ1,βᵝ1,μ2,κ2,η2,Λ2,αᵅ2,βᵅ2,αᵝ2,βᵝ2,t)
function ∇ELBOniw(∇Elbo,
		  r,
                 μ, κ, η, Λ, αᵅ, βᵅ, αᵝ, βᵝ,
                μ1,κ1,η1,Λ1,αᵅ1,βᵅ1,αᵝ1,βᵝ1,
		μ2,κ2,η2,Λ2,αᵅ2,βᵅ2,αᵝ2,βᵝ2,t)
ForwardDiff.gradient!(∇Elbo,F(r,μ, κ, η, Λ,μ1,κ1,η1,Λ1,αᵅ1,βᵅ1,αᵝ1,βᵝ1,μ2,κ2,η2,Λ2,αᵅ2,βᵅ2,αᵝ2,βᵝ2,t),[αᵅ;βᵅ;αᵝ;βᵝ])
end

